###################################################################

# Created by write_sdc on Wed Dec 17 14:35:46 2025

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_max_fanout 16 [current_design]
set_max_transition 1 [current_design]
set_max_capacitance 0.5 [current_design]
set_max_area 1.0e+09
set_driving_cell -lib_cell INVX1TS [get_ports {din[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports valid_in]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports cload]
set_load -pin_load 0.01 [get_ports {dout[15]}]
set_load -pin_load 0.01 [get_ports {dout[14]}]
set_load -pin_load 0.01 [get_ports {dout[13]}]
set_load -pin_load 0.01 [get_ports {dout[12]}]
set_load -pin_load 0.01 [get_ports {dout[11]}]
set_load -pin_load 0.01 [get_ports {dout[10]}]
set_load -pin_load 0.01 [get_ports {dout[9]}]
set_load -pin_load 0.01 [get_ports {dout[8]}]
set_load -pin_load 0.01 [get_ports {dout[7]}]
set_load -pin_load 0.01 [get_ports {dout[6]}]
set_load -pin_load 0.01 [get_ports {dout[5]}]
set_load -pin_load 0.01 [get_ports {dout[4]}]
set_load -pin_load 0.01 [get_ports {dout[3]}]
set_load -pin_load 0.01 [get_ports {dout[2]}]
set_load -pin_load 0.01 [get_ports {dout[1]}]
set_load -pin_load 0.01 [get_ports {dout[0]}]
set_load -pin_load 0.01 [get_ports valid_out]
set_max_capacitance 0.005 [get_ports clk1]
set_max_capacitance 0.005 [get_ports clk2]
set_max_capacitance 0.005 [get_ports rstn]
set_max_capacitance 0.005 [get_ports {din[15]}]
set_max_capacitance 0.005 [get_ports {din[14]}]
set_max_capacitance 0.005 [get_ports {din[13]}]
set_max_capacitance 0.005 [get_ports {din[12]}]
set_max_capacitance 0.005 [get_ports {din[11]}]
set_max_capacitance 0.005 [get_ports {din[10]}]
set_max_capacitance 0.005 [get_ports {din[9]}]
set_max_capacitance 0.005 [get_ports {din[8]}]
set_max_capacitance 0.005 [get_ports {din[7]}]
set_max_capacitance 0.005 [get_ports {din[6]}]
set_max_capacitance 0.005 [get_ports {din[5]}]
set_max_capacitance 0.005 [get_ports {din[4]}]
set_max_capacitance 0.005 [get_ports {din[3]}]
set_max_capacitance 0.005 [get_ports {din[2]}]
set_max_capacitance 0.005 [get_ports {din[1]}]
set_max_capacitance 0.005 [get_ports {din[0]}]
set_max_capacitance 0.005 [get_ports valid_in]
set_max_capacitance 0.005 [get_ports {cin[15]}]
set_max_capacitance 0.005 [get_ports {cin[14]}]
set_max_capacitance 0.005 [get_ports {cin[13]}]
set_max_capacitance 0.005 [get_ports {cin[12]}]
set_max_capacitance 0.005 [get_ports {cin[11]}]
set_max_capacitance 0.005 [get_ports {cin[10]}]
set_max_capacitance 0.005 [get_ports {cin[9]}]
set_max_capacitance 0.005 [get_ports {cin[8]}]
set_max_capacitance 0.005 [get_ports {cin[7]}]
set_max_capacitance 0.005 [get_ports {cin[6]}]
set_max_capacitance 0.005 [get_ports {cin[5]}]
set_max_capacitance 0.005 [get_ports {cin[4]}]
set_max_capacitance 0.005 [get_ports {cin[3]}]
set_max_capacitance 0.005 [get_ports {cin[2]}]
set_max_capacitance 0.005 [get_ports {cin[1]}]
set_max_capacitance 0.005 [get_ports {cin[0]}]
set_max_capacitance 0.005 [get_ports {caddr[5]}]
set_max_capacitance 0.005 [get_ports {caddr[4]}]
set_max_capacitance 0.005 [get_ports {caddr[3]}]
set_max_capacitance 0.005 [get_ports {caddr[2]}]
set_max_capacitance 0.005 [get_ports {caddr[1]}]
set_max_capacitance 0.005 [get_ports {caddr[0]}]
set_max_capacitance 0.005 [get_ports cload]
set_max_fanout 16 [get_ports clk1]
set_max_fanout 16 [get_ports clk2]
set_max_fanout 16 [get_ports rstn]
set_max_fanout 16 [get_ports {din[15]}]
set_max_fanout 16 [get_ports {din[14]}]
set_max_fanout 16 [get_ports {din[13]}]
set_max_fanout 16 [get_ports {din[12]}]
set_max_fanout 16 [get_ports {din[11]}]
set_max_fanout 16 [get_ports {din[10]}]
set_max_fanout 16 [get_ports {din[9]}]
set_max_fanout 16 [get_ports {din[8]}]
set_max_fanout 16 [get_ports {din[7]}]
set_max_fanout 16 [get_ports {din[6]}]
set_max_fanout 16 [get_ports {din[5]}]
set_max_fanout 16 [get_ports {din[4]}]
set_max_fanout 16 [get_ports {din[3]}]
set_max_fanout 16 [get_ports {din[2]}]
set_max_fanout 16 [get_ports {din[1]}]
set_max_fanout 16 [get_ports {din[0]}]
set_max_fanout 16 [get_ports valid_in]
set_max_fanout 16 [get_ports {cin[15]}]
set_max_fanout 16 [get_ports {cin[14]}]
set_max_fanout 16 [get_ports {cin[13]}]
set_max_fanout 16 [get_ports {cin[12]}]
set_max_fanout 16 [get_ports {cin[11]}]
set_max_fanout 16 [get_ports {cin[10]}]
set_max_fanout 16 [get_ports {cin[9]}]
set_max_fanout 16 [get_ports {cin[8]}]
set_max_fanout 16 [get_ports {cin[7]}]
set_max_fanout 16 [get_ports {cin[6]}]
set_max_fanout 16 [get_ports {cin[5]}]
set_max_fanout 16 [get_ports {cin[4]}]
set_max_fanout 16 [get_ports {cin[3]}]
set_max_fanout 16 [get_ports {cin[2]}]
set_max_fanout 16 [get_ports {cin[1]}]
set_max_fanout 16 [get_ports {cin[0]}]
set_max_fanout 16 [get_ports {caddr[5]}]
set_max_fanout 16 [get_ports {caddr[4]}]
set_max_fanout 16 [get_ports {caddr[3]}]
set_max_fanout 16 [get_ports {caddr[2]}]
set_max_fanout 16 [get_ports {caddr[1]}]
set_max_fanout 16 [get_ports {caddr[0]}]
set_max_fanout 16 [get_ports cload]
set_max_transition 2 [get_ports rstn]
set_ideal_network [get_ports rstn]
create_clock [get_ports clk1]  -period 100000  -waveform {0 50000}
set_clock_uncertainty -setup 1  [get_clocks clk1]
set_clock_uncertainty -hold 0.1  [get_clocks clk1]
set_clock_transition -max -rise 1 [get_clocks clk1]
set_clock_transition -max -fall 1 [get_clocks clk1]
set_clock_transition -min -rise 1 [get_clocks clk1]
set_clock_transition -min -fall 1 [get_clocks clk1]
create_clock [get_ports clk2]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.25  [get_clocks clk2]
set_clock_transition -max -rise 0.15 [get_clocks clk2]
set_clock_transition -max -fall 0.15 [get_clocks clk2]
set_clock_transition -min -rise 0.15 [get_clocks clk2]
set_clock_transition -min -fall 0.15 [get_clocks clk2]
group_path -name MAC_PATH  -from [list [get_pins {u_alu/a_q15[15]}] [get_pins {u_alu/a_q15[14]}]         \
[get_pins {u_alu/a_q15[13]}] [get_pins {u_alu/a_q15[12]}] [get_pins            \
{u_alu/a_q15[11]}] [get_pins {u_alu/a_q15[10]}] [get_pins {u_alu/a_q15[9]}]    \
[get_pins {u_alu/a_q15[8]}] [get_pins {u_alu/a_q15[7]}] [get_pins              \
{u_alu/a_q15[6]}] [get_pins {u_alu/a_q15[5]}] [get_pins {u_alu/a_q15[4]}]      \
[get_pins {u_alu/a_q15[3]}] [get_pins {u_alu/a_q15[2]}] [get_pins              \
{u_alu/a_q15[1]}] [get_pins {u_alu/a_q15[0]}]]  -to [list [get_pins {u_alu/y_q7_9[15]}] [get_pins {u_alu/y_q7_9[14]}]         \
[get_pins {u_alu/y_q7_9[13]}] [get_pins {u_alu/y_q7_9[12]}] [get_pins          \
{u_alu/y_q7_9[11]}] [get_pins {u_alu/y_q7_9[10]}] [get_pins {u_alu/y_q7_9[9]}] \
[get_pins {u_alu/y_q7_9[8]}] [get_pins {u_alu/y_q7_9[7]}] [get_pins            \
{u_alu/y_q7_9[6]}] [get_pins {u_alu/y_q7_9[5]}] [get_pins {u_alu/y_q7_9[4]}]   \
[get_pins {u_alu/y_q7_9[3]}] [get_pins {u_alu/y_q7_9[2]}] [get_pins            \
{u_alu/y_q7_9[1]}] [get_pins {u_alu/y_q7_9[0]}]]
set_max_delay 9  -from [list [get_pins {u_alu/a_q15[15]}] [get_pins {u_alu/a_q15[14]}]         \
[get_pins {u_alu/a_q15[13]}] [get_pins {u_alu/a_q15[12]}] [get_pins            \
{u_alu/a_q15[11]}] [get_pins {u_alu/a_q15[10]}] [get_pins {u_alu/a_q15[9]}]    \
[get_pins {u_alu/a_q15[8]}] [get_pins {u_alu/a_q15[7]}] [get_pins              \
{u_alu/a_q15[6]}] [get_pins {u_alu/a_q15[5]}] [get_pins {u_alu/a_q15[4]}]      \
[get_pins {u_alu/a_q15[3]}] [get_pins {u_alu/a_q15[2]}] [get_pins              \
{u_alu/a_q15[1]}] [get_pins {u_alu/a_q15[0]}]]  -to [list [get_pins {u_alu/y_q7_9[15]}] [get_pins {u_alu/y_q7_9[14]}]         \
[get_pins {u_alu/y_q7_9[13]}] [get_pins {u_alu/y_q7_9[12]}] [get_pins          \
{u_alu/y_q7_9[11]}] [get_pins {u_alu/y_q7_9[10]}] [get_pins {u_alu/y_q7_9[9]}] \
[get_pins {u_alu/y_q7_9[8]}] [get_pins {u_alu/y_q7_9[7]}] [get_pins            \
{u_alu/y_q7_9[6]}] [get_pins {u_alu/y_q7_9[5]}] [get_pins {u_alu/y_q7_9[4]}]   \
[get_pins {u_alu/y_q7_9[3]}] [get_pins {u_alu/y_q7_9[2]}] [get_pins            \
{u_alu/y_q7_9[1]}] [get_pins {u_alu/y_q7_9[0]}]]
set_false_path   -from [get_ports rstn]
set_max_delay 90000  -from [get_clocks clk1]  -to [get_clocks clk1]
set_max_delay 9  -from [get_clocks clk2]  -to [get_clocks clk2]
set_input_delay -clock clk1  10000  [get_ports valid_in]
set_input_delay -clock clk1  10000  [get_ports {din[15]}]
set_input_delay -clock clk1  10000  [get_ports {din[14]}]
set_input_delay -clock clk1  10000  [get_ports {din[13]}]
set_input_delay -clock clk1  10000  [get_ports {din[12]}]
set_input_delay -clock clk1  10000  [get_ports {din[11]}]
set_input_delay -clock clk1  10000  [get_ports {din[10]}]
set_input_delay -clock clk1  10000  [get_ports {din[9]}]
set_input_delay -clock clk1  10000  [get_ports {din[8]}]
set_input_delay -clock clk1  10000  [get_ports {din[7]}]
set_input_delay -clock clk1  10000  [get_ports {din[6]}]
set_input_delay -clock clk1  10000  [get_ports {din[5]}]
set_input_delay -clock clk1  10000  [get_ports {din[4]}]
set_input_delay -clock clk1  10000  [get_ports {din[3]}]
set_input_delay -clock clk1  10000  [get_ports {din[2]}]
set_input_delay -clock clk1  10000  [get_ports {din[1]}]
set_input_delay -clock clk1  10000  [get_ports {din[0]}]
set_input_delay -clock clk2  1  [get_ports cload]
set_input_delay -clock clk2  1  [get_ports {caddr[5]}]
set_input_delay -clock clk2  1  [get_ports {caddr[4]}]
set_input_delay -clock clk2  1  [get_ports {caddr[3]}]
set_input_delay -clock clk2  1  [get_ports {caddr[2]}]
set_input_delay -clock clk2  1  [get_ports {caddr[1]}]
set_input_delay -clock clk2  1  [get_ports {caddr[0]}]
set_input_delay -clock clk2  1  [get_ports {cin[15]}]
set_input_delay -clock clk2  1  [get_ports {cin[14]}]
set_input_delay -clock clk2  1  [get_ports {cin[13]}]
set_input_delay -clock clk2  1  [get_ports {cin[12]}]
set_input_delay -clock clk2  1  [get_ports {cin[11]}]
set_input_delay -clock clk2  1  [get_ports {cin[10]}]
set_input_delay -clock clk2  1  [get_ports {cin[9]}]
set_input_delay -clock clk2  1  [get_ports {cin[8]}]
set_input_delay -clock clk2  1  [get_ports {cin[7]}]
set_input_delay -clock clk2  1  [get_ports {cin[6]}]
set_input_delay -clock clk2  1  [get_ports {cin[5]}]
set_input_delay -clock clk2  1  [get_ports {cin[4]}]
set_input_delay -clock clk2  1  [get_ports {cin[3]}]
set_input_delay -clock clk2  1  [get_ports {cin[2]}]
set_input_delay -clock clk2  1  [get_ports {cin[1]}]
set_input_delay -clock clk2  1  [get_ports {cin[0]}]
set_output_delay -clock clk2  0.5  [get_ports valid_out]
set_output_delay -clock clk2  0.5  [get_ports {dout[15]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[14]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[13]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[12]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[11]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[10]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[9]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[8]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[7]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[6]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[5]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[4]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[3]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[2]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[1]}]
set_output_delay -clock clk2  0.5  [get_ports {dout[0]}]
set_clock_groups  -asynchronous -name clk1_1  -group [get_clocks clk1] -group  \
[get_clocks clk2]
