###################################################################

# Created by write_sdc on Sun Nov 23 15:10:41 2025

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 1.0e+09
set_driving_cell -lib_cell INVX1TS [get_ports clk2]
set_driving_cell -lib_cell INVX1TS [get_ports rstn]
set_driving_cell -lib_cell INVX1TS [get_ports cload]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports ren]
set_driving_cell -lib_cell INVX1TS [get_ports {raddr[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {raddr[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {raddr[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {raddr[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {raddr[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {raddr[0]}]
set_load -pin_load 0.01 [get_ports {cout[15]}]
set_load -pin_load 0.01 [get_ports {cout[14]}]
set_load -pin_load 0.01 [get_ports {cout[13]}]
set_load -pin_load 0.01 [get_ports {cout[12]}]
set_load -pin_load 0.01 [get_ports {cout[11]}]
set_load -pin_load 0.01 [get_ports {cout[10]}]
set_load -pin_load 0.01 [get_ports {cout[9]}]
set_load -pin_load 0.01 [get_ports {cout[8]}]
set_load -pin_load 0.01 [get_ports {cout[7]}]
set_load -pin_load 0.01 [get_ports {cout[6]}]
set_load -pin_load 0.01 [get_ports {cout[5]}]
set_load -pin_load 0.01 [get_ports {cout[4]}]
set_load -pin_load 0.01 [get_ports {cout[3]}]
set_load -pin_load 0.01 [get_ports {cout[2]}]
set_load -pin_load 0.01 [get_ports {cout[1]}]
set_load -pin_load 0.01 [get_ports {cout[0]}]
set_max_capacitance 0.005 [get_ports clk2]
set_max_capacitance 0.005 [get_ports rstn]
set_max_capacitance 0.005 [get_ports cload]
set_max_capacitance 0.005 [get_ports {caddr[5]}]
set_max_capacitance 0.005 [get_ports {caddr[4]}]
set_max_capacitance 0.005 [get_ports {caddr[3]}]
set_max_capacitance 0.005 [get_ports {caddr[2]}]
set_max_capacitance 0.005 [get_ports {caddr[1]}]
set_max_capacitance 0.005 [get_ports {caddr[0]}]
set_max_capacitance 0.005 [get_ports {cin[15]}]
set_max_capacitance 0.005 [get_ports {cin[14]}]
set_max_capacitance 0.005 [get_ports {cin[13]}]
set_max_capacitance 0.005 [get_ports {cin[12]}]
set_max_capacitance 0.005 [get_ports {cin[11]}]
set_max_capacitance 0.005 [get_ports {cin[10]}]
set_max_capacitance 0.005 [get_ports {cin[9]}]
set_max_capacitance 0.005 [get_ports {cin[8]}]
set_max_capacitance 0.005 [get_ports {cin[7]}]
set_max_capacitance 0.005 [get_ports {cin[6]}]
set_max_capacitance 0.005 [get_ports {cin[5]}]
set_max_capacitance 0.005 [get_ports {cin[4]}]
set_max_capacitance 0.005 [get_ports {cin[3]}]
set_max_capacitance 0.005 [get_ports {cin[2]}]
set_max_capacitance 0.005 [get_ports {cin[1]}]
set_max_capacitance 0.005 [get_ports {cin[0]}]
set_max_capacitance 0.005 [get_ports ren]
set_max_capacitance 0.005 [get_ports {raddr[5]}]
set_max_capacitance 0.005 [get_ports {raddr[4]}]
set_max_capacitance 0.005 [get_ports {raddr[3]}]
set_max_capacitance 0.005 [get_ports {raddr[2]}]
set_max_capacitance 0.005 [get_ports {raddr[1]}]
set_max_capacitance 0.005 [get_ports {raddr[0]}]
set_max_fanout 16 [get_ports clk2]
set_max_fanout 16 [get_ports rstn]
set_max_fanout 16 [get_ports cload]
set_max_fanout 16 [get_ports {caddr[5]}]
set_max_fanout 16 [get_ports {caddr[4]}]
set_max_fanout 16 [get_ports {caddr[3]}]
set_max_fanout 16 [get_ports {caddr[2]}]
set_max_fanout 16 [get_ports {caddr[1]}]
set_max_fanout 16 [get_ports {caddr[0]}]
set_max_fanout 16 [get_ports {cin[15]}]
set_max_fanout 16 [get_ports {cin[14]}]
set_max_fanout 16 [get_ports {cin[13]}]
set_max_fanout 16 [get_ports {cin[12]}]
set_max_fanout 16 [get_ports {cin[11]}]
set_max_fanout 16 [get_ports {cin[10]}]
set_max_fanout 16 [get_ports {cin[9]}]
set_max_fanout 16 [get_ports {cin[8]}]
set_max_fanout 16 [get_ports {cin[7]}]
set_max_fanout 16 [get_ports {cin[6]}]
set_max_fanout 16 [get_ports {cin[5]}]
set_max_fanout 16 [get_ports {cin[4]}]
set_max_fanout 16 [get_ports {cin[3]}]
set_max_fanout 16 [get_ports {cin[2]}]
set_max_fanout 16 [get_ports {cin[1]}]
set_max_fanout 16 [get_ports {cin[0]}]
set_max_fanout 16 [get_ports ren]
set_max_fanout 16 [get_ports {raddr[5]}]
set_max_fanout 16 [get_ports {raddr[4]}]
set_max_fanout 16 [get_ports {raddr[3]}]
set_max_fanout 16 [get_ports {raddr[2]}]
set_max_fanout 16 [get_ports {raddr[1]}]
set_max_fanout 16 [get_ports {raddr[0]}]
set_max_transition 2 [get_ports rstn]
create_clock [get_ports clk2]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.25  [get_clocks clk2]
set_clock_transition -max -rise 0.15 [get_clocks clk2]
set_clock_transition -max -fall 0.15 [get_clocks clk2]
set_clock_transition -min -rise 0.15 [get_clocks clk2]
set_clock_transition -min -fall 0.15 [get_clocks clk2]
set_false_path   -from [get_ports rstn]
set_multicycle_path 1 -hold -from [get_ports cload]
set_multicycle_path 2 -setup -from [get_ports cload]
set_input_delay -clock clk2  1  [get_ports cload]
set_input_delay -clock clk2  1  [get_ports {caddr[5]}]
set_input_delay -clock clk2  1  [get_ports {caddr[4]}]
set_input_delay -clock clk2  1  [get_ports {caddr[3]}]
set_input_delay -clock clk2  1  [get_ports {caddr[2]}]
set_input_delay -clock clk2  1  [get_ports {caddr[1]}]
set_input_delay -clock clk2  1  [get_ports {caddr[0]}]
set_input_delay -clock clk2  1  [get_ports {cin[15]}]
set_input_delay -clock clk2  1  [get_ports {cin[14]}]
set_input_delay -clock clk2  1  [get_ports {cin[13]}]
set_input_delay -clock clk2  1  [get_ports {cin[12]}]
set_input_delay -clock clk2  1  [get_ports {cin[11]}]
set_input_delay -clock clk2  1  [get_ports {cin[10]}]
set_input_delay -clock clk2  1  [get_ports {cin[9]}]
set_input_delay -clock clk2  1  [get_ports {cin[8]}]
set_input_delay -clock clk2  1  [get_ports {cin[7]}]
set_input_delay -clock clk2  1  [get_ports {cin[6]}]
set_input_delay -clock clk2  1  [get_ports {cin[5]}]
set_input_delay -clock clk2  1  [get_ports {cin[4]}]
set_input_delay -clock clk2  1  [get_ports {cin[3]}]
set_input_delay -clock clk2  1  [get_ports {cin[2]}]
set_input_delay -clock clk2  1  [get_ports {cin[1]}]
set_input_delay -clock clk2  1  [get_ports {cin[0]}]
set_input_delay -clock clk2  1  [get_ports ren]
set_input_delay -clock clk2  1  [get_ports {raddr[5]}]
set_input_delay -clock clk2  1  [get_ports {raddr[4]}]
set_input_delay -clock clk2  1  [get_ports {raddr[3]}]
set_input_delay -clock clk2  1  [get_ports {raddr[2]}]
set_input_delay -clock clk2  1  [get_ports {raddr[1]}]
set_input_delay -clock clk2  1  [get_ports {raddr[0]}]
set_output_delay -clock clk2  1  [get_ports {cout[15]}]
set_output_delay -clock clk2  1  [get_ports {cout[14]}]
set_output_delay -clock clk2  1  [get_ports {cout[13]}]
set_output_delay -clock clk2  1  [get_ports {cout[12]}]
set_output_delay -clock clk2  1  [get_ports {cout[11]}]
set_output_delay -clock clk2  1  [get_ports {cout[10]}]
set_output_delay -clock clk2  1  [get_ports {cout[9]}]
set_output_delay -clock clk2  1  [get_ports {cout[8]}]
set_output_delay -clock clk2  1  [get_ports {cout[7]}]
set_output_delay -clock clk2  1  [get_ports {cout[6]}]
set_output_delay -clock clk2  1  [get_ports {cout[5]}]
set_output_delay -clock clk2  1  [get_ports {cout[4]}]
set_output_delay -clock clk2  1  [get_ports {cout[3]}]
set_output_delay -clock clk2  1  [get_ports {cout[2]}]
set_output_delay -clock clk2  1  [get_ports {cout[1]}]
set_output_delay -clock clk2  1  [get_ports {cout[0]}]
