###################################################################

# Created by write_sdc on Fri Nov 21 14:03:59 2025

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 16 [current_design]
set_max_area 1.0e+09
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports rstn]
set_driving_cell -lib_cell INVX1TS [get_ports en_mac]
set_driving_cell -lib_cell INVX1TS [get_ports clr_acc]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a_q15[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b_q15[0]}]
set_load -pin_load 0.005 [get_ports {acc_out[39]}]
set_load -pin_load 0.005 [get_ports {acc_out[38]}]
set_load -pin_load 0.005 [get_ports {acc_out[37]}]
set_load -pin_load 0.005 [get_ports {acc_out[36]}]
set_load -pin_load 0.005 [get_ports {acc_out[35]}]
set_load -pin_load 0.005 [get_ports {acc_out[34]}]
set_load -pin_load 0.005 [get_ports {acc_out[33]}]
set_load -pin_load 0.005 [get_ports {acc_out[32]}]
set_load -pin_load 0.005 [get_ports {acc_out[31]}]
set_load -pin_load 0.005 [get_ports {acc_out[30]}]
set_load -pin_load 0.005 [get_ports {acc_out[29]}]
set_load -pin_load 0.005 [get_ports {acc_out[28]}]
set_load -pin_load 0.005 [get_ports {acc_out[27]}]
set_load -pin_load 0.005 [get_ports {acc_out[26]}]
set_load -pin_load 0.005 [get_ports {acc_out[25]}]
set_load -pin_load 0.005 [get_ports {acc_out[24]}]
set_load -pin_load 0.005 [get_ports {acc_out[23]}]
set_load -pin_load 0.005 [get_ports {acc_out[22]}]
set_load -pin_load 0.005 [get_ports {acc_out[21]}]
set_load -pin_load 0.005 [get_ports {acc_out[20]}]
set_load -pin_load 0.005 [get_ports {acc_out[19]}]
set_load -pin_load 0.005 [get_ports {acc_out[18]}]
set_load -pin_load 0.005 [get_ports {acc_out[17]}]
set_load -pin_load 0.005 [get_ports {acc_out[16]}]
set_load -pin_load 0.005 [get_ports {acc_out[15]}]
set_load -pin_load 0.005 [get_ports {acc_out[14]}]
set_load -pin_load 0.005 [get_ports {acc_out[13]}]
set_load -pin_load 0.005 [get_ports {acc_out[12]}]
set_load -pin_load 0.005 [get_ports {acc_out[11]}]
set_load -pin_load 0.005 [get_ports {acc_out[10]}]
set_load -pin_load 0.005 [get_ports {acc_out[9]}]
set_load -pin_load 0.005 [get_ports {acc_out[8]}]
set_load -pin_load 0.005 [get_ports {acc_out[7]}]
set_load -pin_load 0.005 [get_ports {acc_out[6]}]
set_load -pin_load 0.005 [get_ports {acc_out[5]}]
set_load -pin_load 0.005 [get_ports {acc_out[4]}]
set_load -pin_load 0.005 [get_ports {acc_out[3]}]
set_load -pin_load 0.005 [get_ports {acc_out[2]}]
set_load -pin_load 0.005 [get_ports {acc_out[1]}]
set_load -pin_load 0.005 [get_ports {acc_out[0]}]
set_load -pin_load 0.005 [get_ports {prod_q30[31]}]
set_load -pin_load 0.005 [get_ports {prod_q30[30]}]
set_load -pin_load 0.005 [get_ports {prod_q30[29]}]
set_load -pin_load 0.005 [get_ports {prod_q30[28]}]
set_load -pin_load 0.005 [get_ports {prod_q30[27]}]
set_load -pin_load 0.005 [get_ports {prod_q30[26]}]
set_load -pin_load 0.005 [get_ports {prod_q30[25]}]
set_load -pin_load 0.005 [get_ports {prod_q30[24]}]
set_load -pin_load 0.005 [get_ports {prod_q30[23]}]
set_load -pin_load 0.005 [get_ports {prod_q30[22]}]
set_load -pin_load 0.005 [get_ports {prod_q30[21]}]
set_load -pin_load 0.005 [get_ports {prod_q30[20]}]
set_load -pin_load 0.005 [get_ports {prod_q30[19]}]
set_load -pin_load 0.005 [get_ports {prod_q30[18]}]
set_load -pin_load 0.005 [get_ports {prod_q30[17]}]
set_load -pin_load 0.005 [get_ports {prod_q30[16]}]
set_load -pin_load 0.005 [get_ports {prod_q30[15]}]
set_load -pin_load 0.005 [get_ports {prod_q30[14]}]
set_load -pin_load 0.005 [get_ports {prod_q30[13]}]
set_load -pin_load 0.005 [get_ports {prod_q30[12]}]
set_load -pin_load 0.005 [get_ports {prod_q30[11]}]
set_load -pin_load 0.005 [get_ports {prod_q30[10]}]
set_load -pin_load 0.005 [get_ports {prod_q30[9]}]
set_load -pin_load 0.005 [get_ports {prod_q30[8]}]
set_load -pin_load 0.005 [get_ports {prod_q30[7]}]
set_load -pin_load 0.005 [get_ports {prod_q30[6]}]
set_load -pin_load 0.005 [get_ports {prod_q30[5]}]
set_load -pin_load 0.005 [get_ports {prod_q30[4]}]
set_load -pin_load 0.005 [get_ports {prod_q30[3]}]
set_load -pin_load 0.005 [get_ports {prod_q30[2]}]
set_load -pin_load 0.005 [get_ports {prod_q30[1]}]
set_load -pin_load 0.005 [get_ports {prod_q30[0]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[15]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[14]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[13]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[12]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[11]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[10]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[9]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[8]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[7]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[6]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[5]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[4]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[3]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[2]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[1]}]
set_load -pin_load 0.005 [get_ports {y_q7_9[0]}]
set_load -pin_load 0.005 [get_ports y_saturated]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rstn]
set_max_capacitance 0.005 [get_ports en_mac]
set_max_capacitance 0.005 [get_ports clr_acc]
set_max_capacitance 0.005 [get_ports {a_q15[15]}]
set_max_capacitance 0.005 [get_ports {a_q15[14]}]
set_max_capacitance 0.005 [get_ports {a_q15[13]}]
set_max_capacitance 0.005 [get_ports {a_q15[12]}]
set_max_capacitance 0.005 [get_ports {a_q15[11]}]
set_max_capacitance 0.005 [get_ports {a_q15[10]}]
set_max_capacitance 0.005 [get_ports {a_q15[9]}]
set_max_capacitance 0.005 [get_ports {a_q15[8]}]
set_max_capacitance 0.005 [get_ports {a_q15[7]}]
set_max_capacitance 0.005 [get_ports {a_q15[6]}]
set_max_capacitance 0.005 [get_ports {a_q15[5]}]
set_max_capacitance 0.005 [get_ports {a_q15[4]}]
set_max_capacitance 0.005 [get_ports {a_q15[3]}]
set_max_capacitance 0.005 [get_ports {a_q15[2]}]
set_max_capacitance 0.005 [get_ports {a_q15[1]}]
set_max_capacitance 0.005 [get_ports {a_q15[0]}]
set_max_capacitance 0.005 [get_ports {b_q15[15]}]
set_max_capacitance 0.005 [get_ports {b_q15[14]}]
set_max_capacitance 0.005 [get_ports {b_q15[13]}]
set_max_capacitance 0.005 [get_ports {b_q15[12]}]
set_max_capacitance 0.005 [get_ports {b_q15[11]}]
set_max_capacitance 0.005 [get_ports {b_q15[10]}]
set_max_capacitance 0.005 [get_ports {b_q15[9]}]
set_max_capacitance 0.005 [get_ports {b_q15[8]}]
set_max_capacitance 0.005 [get_ports {b_q15[7]}]
set_max_capacitance 0.005 [get_ports {b_q15[6]}]
set_max_capacitance 0.005 [get_ports {b_q15[5]}]
set_max_capacitance 0.005 [get_ports {b_q15[4]}]
set_max_capacitance 0.005 [get_ports {b_q15[3]}]
set_max_capacitance 0.005 [get_ports {b_q15[2]}]
set_max_capacitance 0.005 [get_ports {b_q15[1]}]
set_max_capacitance 0.005 [get_ports {b_q15[0]}]
set_max_fanout 16 [get_ports clk]
set_max_fanout 16 [get_ports rstn]
set_max_fanout 16 [get_ports en_mac]
set_max_fanout 16 [get_ports clr_acc]
set_max_fanout 16 [get_ports {a_q15[15]}]
set_max_fanout 16 [get_ports {a_q15[14]}]
set_max_fanout 16 [get_ports {a_q15[13]}]
set_max_fanout 16 [get_ports {a_q15[12]}]
set_max_fanout 16 [get_ports {a_q15[11]}]
set_max_fanout 16 [get_ports {a_q15[10]}]
set_max_fanout 16 [get_ports {a_q15[9]}]
set_max_fanout 16 [get_ports {a_q15[8]}]
set_max_fanout 16 [get_ports {a_q15[7]}]
set_max_fanout 16 [get_ports {a_q15[6]}]
set_max_fanout 16 [get_ports {a_q15[5]}]
set_max_fanout 16 [get_ports {a_q15[4]}]
set_max_fanout 16 [get_ports {a_q15[3]}]
set_max_fanout 16 [get_ports {a_q15[2]}]
set_max_fanout 16 [get_ports {a_q15[1]}]
set_max_fanout 16 [get_ports {a_q15[0]}]
set_max_fanout 16 [get_ports {b_q15[15]}]
set_max_fanout 16 [get_ports {b_q15[14]}]
set_max_fanout 16 [get_ports {b_q15[13]}]
set_max_fanout 16 [get_ports {b_q15[12]}]
set_max_fanout 16 [get_ports {b_q15[11]}]
set_max_fanout 16 [get_ports {b_q15[10]}]
set_max_fanout 16 [get_ports {b_q15[9]}]
set_max_fanout 16 [get_ports {b_q15[8]}]
set_max_fanout 16 [get_ports {b_q15[7]}]
set_max_fanout 16 [get_ports {b_q15[6]}]
set_max_fanout 16 [get_ports {b_q15[5]}]
set_max_fanout 16 [get_ports {b_q15[4]}]
set_max_fanout 16 [get_ports {b_q15[3]}]
set_max_fanout 16 [get_ports {b_q15[2]}]
set_max_fanout 16 [get_ports {b_q15[1]}]
set_max_fanout 16 [get_ports {b_q15[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  2  [get_ports rstn]
set_input_delay -clock clk  2  [get_ports en_mac]
set_input_delay -clock clk  2  [get_ports clr_acc]
set_input_delay -clock clk  2  [get_ports {a_q15[15]}]
set_input_delay -clock clk  2  [get_ports {a_q15[14]}]
set_input_delay -clock clk  2  [get_ports {a_q15[13]}]
set_input_delay -clock clk  2  [get_ports {a_q15[12]}]
set_input_delay -clock clk  2  [get_ports {a_q15[11]}]
set_input_delay -clock clk  2  [get_ports {a_q15[10]}]
set_input_delay -clock clk  2  [get_ports {a_q15[9]}]
set_input_delay -clock clk  2  [get_ports {a_q15[8]}]
set_input_delay -clock clk  2  [get_ports {a_q15[7]}]
set_input_delay -clock clk  2  [get_ports {a_q15[6]}]
set_input_delay -clock clk  2  [get_ports {a_q15[5]}]
set_input_delay -clock clk  2  [get_ports {a_q15[4]}]
set_input_delay -clock clk  2  [get_ports {a_q15[3]}]
set_input_delay -clock clk  2  [get_ports {a_q15[2]}]
set_input_delay -clock clk  2  [get_ports {a_q15[1]}]
set_input_delay -clock clk  2  [get_ports {a_q15[0]}]
set_input_delay -clock clk  2  [get_ports {b_q15[15]}]
set_input_delay -clock clk  2  [get_ports {b_q15[14]}]
set_input_delay -clock clk  2  [get_ports {b_q15[13]}]
set_input_delay -clock clk  2  [get_ports {b_q15[12]}]
set_input_delay -clock clk  2  [get_ports {b_q15[11]}]
set_input_delay -clock clk  2  [get_ports {b_q15[10]}]
set_input_delay -clock clk  2  [get_ports {b_q15[9]}]
set_input_delay -clock clk  2  [get_ports {b_q15[8]}]
set_input_delay -clock clk  2  [get_ports {b_q15[7]}]
set_input_delay -clock clk  2  [get_ports {b_q15[6]}]
set_input_delay -clock clk  2  [get_ports {b_q15[5]}]
set_input_delay -clock clk  2  [get_ports {b_q15[4]}]
set_input_delay -clock clk  2  [get_ports {b_q15[3]}]
set_input_delay -clock clk  2  [get_ports {b_q15[2]}]
set_input_delay -clock clk  2  [get_ports {b_q15[1]}]
set_input_delay -clock clk  2  [get_ports {b_q15[0]}]
set_output_delay -clock clk  2  [get_ports {acc_out[39]}]
set_output_delay -clock clk  2  [get_ports {acc_out[38]}]
set_output_delay -clock clk  2  [get_ports {acc_out[37]}]
set_output_delay -clock clk  2  [get_ports {acc_out[36]}]
set_output_delay -clock clk  2  [get_ports {acc_out[35]}]
set_output_delay -clock clk  2  [get_ports {acc_out[34]}]
set_output_delay -clock clk  2  [get_ports {acc_out[33]}]
set_output_delay -clock clk  2  [get_ports {acc_out[32]}]
set_output_delay -clock clk  2  [get_ports {acc_out[31]}]
set_output_delay -clock clk  2  [get_ports {acc_out[30]}]
set_output_delay -clock clk  2  [get_ports {acc_out[29]}]
set_output_delay -clock clk  2  [get_ports {acc_out[28]}]
set_output_delay -clock clk  2  [get_ports {acc_out[27]}]
set_output_delay -clock clk  2  [get_ports {acc_out[26]}]
set_output_delay -clock clk  2  [get_ports {acc_out[25]}]
set_output_delay -clock clk  2  [get_ports {acc_out[24]}]
set_output_delay -clock clk  2  [get_ports {acc_out[23]}]
set_output_delay -clock clk  2  [get_ports {acc_out[22]}]
set_output_delay -clock clk  2  [get_ports {acc_out[21]}]
set_output_delay -clock clk  2  [get_ports {acc_out[20]}]
set_output_delay -clock clk  2  [get_ports {acc_out[19]}]
set_output_delay -clock clk  2  [get_ports {acc_out[18]}]
set_output_delay -clock clk  2  [get_ports {acc_out[17]}]
set_output_delay -clock clk  2  [get_ports {acc_out[16]}]
set_output_delay -clock clk  2  [get_ports {acc_out[15]}]
set_output_delay -clock clk  2  [get_ports {acc_out[14]}]
set_output_delay -clock clk  2  [get_ports {acc_out[13]}]
set_output_delay -clock clk  2  [get_ports {acc_out[12]}]
set_output_delay -clock clk  2  [get_ports {acc_out[11]}]
set_output_delay -clock clk  2  [get_ports {acc_out[10]}]
set_output_delay -clock clk  2  [get_ports {acc_out[9]}]
set_output_delay -clock clk  2  [get_ports {acc_out[8]}]
set_output_delay -clock clk  2  [get_ports {acc_out[7]}]
set_output_delay -clock clk  2  [get_ports {acc_out[6]}]
set_output_delay -clock clk  2  [get_ports {acc_out[5]}]
set_output_delay -clock clk  2  [get_ports {acc_out[4]}]
set_output_delay -clock clk  2  [get_ports {acc_out[3]}]
set_output_delay -clock clk  2  [get_ports {acc_out[2]}]
set_output_delay -clock clk  2  [get_ports {acc_out[1]}]
set_output_delay -clock clk  2  [get_ports {acc_out[0]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[31]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[30]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[29]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[28]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[27]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[26]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[25]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[24]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[23]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[22]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[21]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[20]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[19]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[18]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[17]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[16]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[15]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[14]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[13]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[12]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[11]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[10]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[9]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[8]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[7]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[6]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[5]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[4]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[3]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[2]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[1]}]
set_output_delay -clock clk  2  [get_ports {prod_q30[0]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[15]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[14]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[13]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[12]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[11]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[10]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[9]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[8]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[7]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[6]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[5]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[4]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[3]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[2]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[1]}]
set_output_delay -clock clk  2  [get_ports {y_q7_9[0]}]
set_output_delay -clock clk  2  [get_ports y_saturated]
